# Length Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Length Property
DuctPressureDropData Class See Also
---
The length of the duct. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace